[
  {
    "title": "calling and glory",
    "date": "2026-02-27",
    "tag": "humanity",
    "body": "in the book 'way of kings' by Brandon Sanderson there is a concept of choosing your calling, and choosing your glory. Both as ways to worship God.\n\nYou choose a profession (calling), and your work becomes a form of worship. Very protestant.\n\nAnd you pick an attribute of God you will embody. Determination, thoughtfulness, tranquility (and presumably negative virtues too - as he is omniscient).\n\nI just like this little framework.\n\nI've always felt that the world is better, and *I feel better* when I embody kindness. And so many good things are downstream of being kind.\n\nDefinitely one to remember."
  },
  {
    "title": "agent vs assistant",
    "date": "2026-02-26",
    "tag": "a.i",
    "body": "If you're thinking about A.I agents (like clawbot) as very smart assistants, you're missing the bigger picture. An assistant executes on tasks you give it, but an agent - the hint is in the name - has agency (or some simulation of it). Not only does it have a task to complete but it can identify what is the best next step - and then figure out with persistence - how to reach it.\n\nThis leads you to think about how entrepreneurship has always been about the leverage of intelligence. The best leaders attract the highest quality intelligence, and then they are used collaboratively to solve large problems for which the market rewards them handsomely.\n\nBut whereas in the past the intelligence was organic, now it is synthetic. And therefore it is producible (and improved) at a significantly faster rate.\n\nThe ones who win will be those that can own and orchestrate the largest amount of synthetic intelligence.\n\nA day after writing the above I read this post from Andrej Karpathy which summed it succinctly:\n\n[https://x.com/karpathy/status/2026731645169185220](https://x.com/karpathy/status/2026731645169185220)\n\n\"The biggest prize is in figuring out how you can keep ascending the layers of abstraction to set up long-running orchestrator Claws with all of the right tools, memory and instructions that productively manage multiple parallel Code instances for you. The leverage achievable via top tier \"agentic engineering\" feels very high right now.\"\n\n<br>"
  },
  {
    "title": "why now?",
    "date": "2026-02-26",
    "tag": "acceleration",
    "body": "Jannuary 15th 2026.\nit felt like a paradigm shift.\nfrom 80% vibe, 20% bug fixing.\nto 100% vibecoding - one shotted. every time.\n\nmy X feed had been ~~having a full down meltdown~~ raving about opus 4.5 since December but I was busy taking drugs in a field off the back-end of a year of retirement. \n\nIn 2019 I spent most of my time interested in buddhism and meditation and the thought of work was very far my mind. \n\nBut sitting down to test build something in January caused an internal paradigm shift.\n\nIt's only been a \\~month since then and it feels like everything is moving fast.\n\nI've always get notebooks with journal entries and ideas. Never thrown one away. They have always been a tool for me to *slow down time* when things feel like they are moving fast. Because our reality is the story we tell ourself and that feeling of acceleration, and of having no grounding, happens when the story we are telling ourself changes so quick we forget the previous chapters.\n\nSo that is why now. I just want to keep a record of what I'm thinking. No pressure to go viral but also public so that my thoughts are forced to be a bit more coherent."
  }
]